#В Институте биоинформатики между информатиками и биологами устраивается соревнование. Победителям соревнования достанется большой и вкусный пирог. В команде биологов 𝑎 человек, а в команде информатиков — 𝑏 человек.

#Нужно заранее разрезать пирог таким образом, чтобы можно было раздать кусочки пирога любой команде, выигравшей соревнование, при этом каждому участнику этой команды должно достаться одинаковое число кусочков пирога. И так как не хочется резать пирог на слишком мелкие кусочки, нужно найти минимальное подходящее число.

#Напишите программу, которая помогает найти это число.
#Программа должна считывать размеры команд (два положительных целых числа 𝑎 и 𝑏, каждое число вводится на отдельной строке) и выводить наименьшее число 𝑑, которое делится на оба этих числа без остатка.

a,b = int(input()), int(input())
d=1
while ((d%a !=0) and (d%b!=0)) or ((d%a ==0) and (d%b!=0)) or ((d%a !=0) and (d%b==0)):
    d+=1
print(d)