"""Напишите программу, которая считывает список чисел 𝑙𝑠𝑡 из первой строки и число 𝑥 из второй строки, которая выводит все позиции, на которых встречается число 𝑥 в переданном списке 𝑙𝑠𝑡.

Позиции нумеруются с нуля, если число 𝑥 не встречается в списке, вывести строку "Отсутствует" (без кавычек, с большой буквы).

Позиции должны быть выведены в одну строку, по возрастанию абсолютного значения.
"""

q=input().split()
x = input()
s=[]
count = q.count(x)
if count>0:
    for i in range(count):
        p=q.index(x)
        s.append(p)
        q.remove(x)
        q.insert(0,"")
    for i in range(len(s)):
        print(s[i],end=" ")
else:
    print("Отсутствует")